# IsConnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..IsConnected Property
Connector Class See Also
---
Identifies if the connector is physically connected to a connector on another element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsConnected { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsConnected As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsConnected {
	bool get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's type is LogicalConn. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace